[
  {
    "id": 0,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أندي هو مدير لمشروع برمجيات. وتمت الموافقة على نطاق المشروع من قبل العميل والمعنيين الرئيسيين في بداية المشروع، ولكن كلما قام العميل بالتحقق من صحة التسليمات، فإنه يطلب متطلبات جديدة يريد أن يضيفها إلى هذا المنتج. يعمل أندي مع العميل للعثور على ما هي المتطلبات التي تم تفويتها في مراحل التخطيط للمشروع وكيفية التخطيط بشكل أفضل في المستقبل. ما هو أفضل وصف للوضع الحالي للمشروع؟",
    "explanation": "تسيب النطاق هو التوسع الغير متحكم به الذي يطرأ على نطاق منتج أو مشروع دون تعديلات في الوقت والتكاليف والموارد",
    "choices": [
      {
        "text": "التخطيط الموجي",
        "correct": false
      },
      {
        "text": "تسيب النطاق",
        "correct": true
      },
      {
        "text": "تحليل البدائل",
        "correct": false
      },
      {
        "text": "تحليل المنتج",
        "correct": false
      }
    ]
  },
  {
    "id": 1,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أنت مدير لمشروع إنشاءات كبير. المشروع لإنشاء فندق جديد. وينقسم المشروع إلى خمس مراحل وهذا المشروع بارز للغاية في المؤسسة التي تعمل بها. لضمان قبول التسليمات رسميًا قررت أن تتحقق من النطاق مع العميل لضمان أن المشروع يسير في الطريق الصحيح من وجهة نظر العميل، متى يجب إجراء عملية التحقق من النطاق؟",
    "explanation": "يتم التحقق من النطاق في نهاية كل مرحلة للتأكد من أن تسليمات المرحلة تم قبولها من العميل قبل الإنتقال للمرحلة التالية",
    "choices": [
      {
        "text": "في نهاية كل مرحلة من المشروع",
        "correct": true
      },
      {
        "text": "في بداية المشروع",
        "correct": false
      },
      {
        "text": "في نهاية المشروع",
        "correct": false
      },
      {
        "text": "أثناء عملية التخطيط",
        "correct": false
      }
    ]
  },
  {
    "id": 2,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "بيتر هو مالك منتج لمشروع برمجيات يتم تنفيذه باستخدام منهجية رشيقة. أثناء مراجعة التكرار، يوضح الفريق إضافة المنتج المكتملة أثناء التكرار الأخير. لقد قام برفض إحدى ميزات المنتج التي قام فريق التطوير بعرضها. ماذا يجب أن يحدث بعد ذلك؟",
    "explanation": "نظرًا لأن الميزة مرفوضة، فهذا يعني أنها لا تتوافق مع تعريف \"المنجز\" أو أن هناك فرقًا بين ما تم تنفيذه وما كان متوقعًا. لذلك، من الضروري سد هذه الفجوة من خلال إعادة كتابة قصص المستخدم ذات الصلة",
    "choices": [
      {
        "text": "يجب أن يحاول الفريق إقناع مالك المنتج بقبول الميزة.",
        "correct": false
      },
      {
        "text": "يجب إضافة قصص المستخدم ذات الصلة إلى سجل أعمال التكرار التالي.",
        "correct": false
      },
      {
        "text": "يجب على الفريق إعادة كتابة قصص المستخدمين ذات الصلة لمعالجة سبب الرفض.",
        "correct": true
      },
      {
        "text": "يتم إرجاع قصص المستخدمين ذات الصلة مرة أخرى إلى سجل أعمال المنتج لإعادة ترتيب الأولويات.",
        "correct": false
      }
    ]
  },
  {
    "id": 3,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "بدأت إحدى الشركات المصنعة للسيارات مشروعًا لبناء سيارات أكثر كفاءة في استهلاك الوقود باستخدام نهج التطوير الهجين. يتكون المشروع من خمس مراحل متتالية ولكل مرحلة عدة مخرجات. يستخدم مدير المشروع بشكل أساسي دورة الحياة التنبؤية مع بعض الممارسات الرشيقة. ما هي الممارسات الرشيقة التي يمكن لمدير المشروع التوصية بها للفريق للتأكد من اكتمال وتسليم المخرجات كما هو متوقع؟",
    "explanation": "تعريف المنجز هو قائمة مراجعة الفريق الخاصة بجميع المعايير المطلوب تلبيتها بحيث يعتبر التسليم جاهزًا لاستخدام العميل. يساعد هذا النهج في ضمان اتفاق المعنيين في بداية المشروع على أن العمل لم يكتمل فحسب، بل تم تحديد الفهم المشترك للإنجاز ومعايير قبول العمل بدقة.",
    "choices": [
      {
        "text": "التقييم بأثر رجعي",
        "correct": false
      },
      {
        "text": "تخطيط التكرار",
        "correct": false
      },
      {
        "text": "تعريف المنجز",
        "correct": true
      },
      {
        "text": "تنقيح سجل الأعمال",
        "correct": false
      }
    ]
  },
  {
    "id": 4,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أي مما يلي هو القاعدة الأساسية أو المبدأ التوجيهي لإنشاء هيكل تجزئة العمل؟",
    "explanation": "هيكل تجزئة العمل عبارة عن تجزئة هرمية لنطاق العمل الكلي. يمثل كل مستوى تنازلي من هيكل تجزئة العمل تعريفًا مفصلاً على نحو متزايد لأعمال المشروع.",
    "choices": [
      {
        "text": "كل مستوى من هيكل تجزئة العمل هو جزء صغير من مستوى أعلى.",
        "correct": true
      },
      {
        "text": "ينبغي أن تدرج العلاقات بين الأنشطة المختلفة.",
        "correct": false
      },
      {
        "text": "كل مستوى من هيكل تجزئة العمل هو جزء أكبر من مستوى أعلى.",
        "correct": false
      },
      {
        "text": "تُدرج الأعمال المخطط لها ضمن المستوى الأعلى لهيكل تجزئة العمل.",
        "correct": false
      }
    ]
  },
  {
    "id": 5,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "يدير سام مشروعًا لتطوير نظام فوترة جديد لإحدى المؤسسات. انتهى من تجميع متطلبات المشروع عندما اكتشف أن متطلبات مدير الشؤون المالية لم يتم تجميعها. أي من المستندات التالية لم يتم تحديثه وتسبب في حدوث هذه المشكلة؟",
    "explanation": "من الواضح أن المدير المالي لم يتم إضافته إلى سجل المعنيين وهذا هو سبب عدم تلبية متطلباته",
    "choices": [
      {
        "text": "توثيق المتطلبات",
        "correct": false
      },
      {
        "text": "ميثاق المشروع",
        "correct": false
      },
      {
        "text": "سجل المعنيين",
        "correct": true
      },
      {
        "text": "مصفوفة تتبع المتطلبات",
        "correct": false
      }
    ]
  },
  {
    "id": 6,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "بدأت مؤسسة إلكترونيات كبيرة مشروعًا لتطوير جهاز ألعاب جديد. الجدول الزمني الأولي لتطوير الجهاز الجديد بمجموعة من الميزات المحددة مسبقًا هو 6 أشهر. أطلق منافس آخر منتجًا مشابهًا بنفس الميزات. قام فريق المشروع بزيادة عدد الميزات ليظل منافس بالسوق. هذا يدفع موعد الإطلاق شهرين آخرين. يُعرف هذا باسم",
    "explanation": "في هذه الحالة يتحول تعريف هدف المشروع الذي يجري إنجازه أو حتى (المنجز) باستمرار، تقوم فرق المشاريع بتتبع المعدلات المخططة لتحقيق الأهداف بالمقارنة مع التقدم نحو استكمال المشروع. كلما استغرق المشروع وقتاً أطول في استكماله، كلما كان من المرجح تحرك هدف تعريف المشروع بانه (منجز) . يشار إلى ذلك في بعض الأحيان بمصطلح (إنجراف المنجز) .",
    "choices": [
      {
        "text": "التجويد Gold plating",
        "correct": false
      },
      {
        "text": "تجزئة النطاق",
        "correct": false
      },
      {
        "text": "إنجراف المنجز",
        "correct": true
      },
      {
        "text": "تسيب النطاق",
        "correct": false
      }
    ]
  },
  {
    "id": 7,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "لقد تم تعيينك لإدارة مشروع برمجيات يجب إكماله خلال ثلاثة أشهر. تم إنشاء ميثاق المشروع. ولقد اجتمعت مع العميل والراعي والمعنيين الرئيسيين لجمع المتطلبات وتم وضع بيان نطاق المشروع. وقد تم وضع خطة إدارة المشروع والموافقة عليها من قبل المعنيين الرئيسيين. لقد اجتمعت مع المستخدم الفعلي الذي سوف يستخدم منتج المشروع لشرح كيفية عمل منتج المشروع واكتشفت أن متطلبات المستخدم تختلف عن تلك التي تم تجميعها في البداية والموافقة عليها من قبل المعنيين الرئيسيين. ماذا يجب أن تفعل؟",
    "explanation": "يجب تجميع المتطلبات الجديدة من مستخدم المنتج والتي قد تؤدي إلى تغيير في أجزاء من خطة إدارة المشروع عن طريق طلب تغيير.",
    "choices": [
      {
        "text": "إنجاز العمل كما كان مخطط له في الأصل.",
        "correct": false
      },
      {
        "text": "إعادة تخطيط المشروع ليشمل المتطلبات الجديدة.",
        "correct": false
      },
      {
        "text": "محاولة الالتقاء بمستخدمين آخرين لجمع متطلبات أخرى.",
        "correct": false
      },
      {
        "text": "إنشاء طلب التغيير لمتطلبات المستخدم.",
        "correct": true
      }
    ]
  },
  {
    "id": 8,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "يعمل فريق المشروع على أول مشروع له باستخدام نهج تكيفي. يقوم منسق الفريق بتدريبهم على استخدام لوحة كانبان وأهمية الحد من العمل قيد التنفيذ (WIP). كل ما يلي هو مزايا للحد من العمل قيد التنفيذ في المشاريع الرشيقة، باستثناء:",
    "explanation": "هو المصطلح (WIP) العمل قيد التنفيذ المعطى للعمل الذي بدأ ولكنه لم يكتمل بعد. ترتبط المستويات الزائدة من العمل قيد التنفيذ بعدد من المشكلات مثل إخفاء الاختناقات وتمثيل المخاطر في شكل إعادة صياغة محتملة واستهلاك رأس المال الاستثماري وعدم تحقيق أي عائد. لا علاقة لها بإدارة موارد المشروع واستخدامها",
    "choices": [
      {
        "text": "يساعد تقييد العمل قيد التنفيذ الفرق الرشيقة على تجنب مخاطر إعادة العمل المحتملة.",
        "correct": false
      },
      {
        "text": "يساعد الحد من العمل قيد التنفيذ الفرق الرشيقة على تحديد الاختناقات وإزالتها بسهولة.",
        "correct": false
      },
      {
        "text": "يسمح الحد من العمل قيد التنفيذ للفرق الرشيقة بتحسين الإنتاجية.",
        "correct": false
      },
      {
        "text": "يتيح تقييد العمل قيد التنفيذ للفرق الرشيقة إدارة موارد المشروع بشكل صحيح وإدارة استخدامها للعمل بكفاءة أكبر.",
        "correct": true
      }
    ]
  },
  {
    "id": 9,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "يقوم أحد أعضاء الفريق بإبلاغ مدير المشروع بأنه قد أضاف وظيفة إضافية إلى حزمة العمل المخصصة له والتي لم يتم تضمينها في التصميم. لم تضف الوظيفة الجديدة أي تكلفة إضافية وقام بإنشائها خلال عطلة نهاية الأسبوع. يعتقد عضو الفريق أنها ستنال رضا العميل وسيقدر ذلك. ماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "يشار  إلى إضافة وظائف غير مخطط لها باسم \"gold plating\" التجويد ولا يوصى بذلك. يجب على الفريق بناء ما تم تصميمه فقط",
    "choices": [
      {
        "text": "يقم بمكافأة عضو الفريق على تلبية وتجاوز توقعات العملاء.",
        "correct": false
      },
      {
        "text": "يقم بإزالة الوظيفة الجديدة وإرشاد عضو الفريق إلى إنشاء ما تم تضمينه في التصميم فقط.",
        "correct": true
      },
      {
        "text": "يقم بشكر عضو الفريق على مجهوده ويدعُ العميل لعقد اجتماع لإبلاغه بالوظيفة المضافة الجديدة.",
        "correct": false
      },
      {
        "text": "يقم بتقديم طلب تغيير لإضافة الوظيفة الجديدة إلى التصميم.",
        "correct": false
      }
    ]
  },
  {
    "id": 10,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "من مزايا مخطط المهام المنجزة ما يلي:",
    "explanation": "الميزة الكبرى لاستخدام مخطط المهام المنجزة هو أنه يمكن أن يظهر تغييرات في النطاق، مما يجعل تأثير تلك التغييرات مرئياً",
    "choices": [
      {
        "text": "يمكن أن يظهر العمل المتبقي الذي يتعين القيام به.",
        "correct": false
      },
      {
        "text": "يمكن أن يظهر التغيرات في تكاليف المشروع.",
        "correct": false
      },
      {
        "text": "يمكن أن يظهر التغيرات في النطاق.",
        "correct": true
      },
      {
        "text": "يمكن أن يظهر أداء الأفراد أعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "id": 11,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أنت تدير مشروعًا صناعيًا. وقد أنتج فريق المشروع بنجاح الإصدار الأول من منتج المشروع. وتقوم إدارة مراقبة الجودة في المؤسسة بفحص هذه التسليمات. ماذا سوف تفعل بعد؟",
    "explanation": "التسليمات التي تم التحقق منها يتم مراجعتها مع العميل للحصول على القبول الرسمي للمنتج من خلال عملية التحقق من النطاق",
    "choices": [
      {
        "text": "يجب مراجعة التسليمات المُتحقق منها مع العميل للحصول على القبول الرسمي للمنتج.",
        "correct": true
      },
      {
        "text": "يجب تسليم التسليمات التي تم التحقق منها إلى العميل وبدء إجراءات إغلاق المشروع.",
        "correct": false
      },
      {
        "text": "توثيق الدروس المستفادة وبدء إجراءات إغلاق المشروع.",
        "correct": false
      },
      {
        "text": "مواصلة إنتاج التسليمات المتبقية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "id": 12,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أنت مدير مشروع تقوم بإنشاء شبكة داخلية لشركتك. أثناء التخطيط لمشروعك مع فريق العمل قمت بتقسيم العمل المطلوب إلى حزم عمل وأنشأت هيكل تجزئة العمل. لكل حزمة عمل كتبت بعض التفاصيل مثل التقديرات الأولية، والافتراضات، وحزم العمل السابقة واللاحقة. أين يتم تخزين هذه المعلومات؟",
    "explanation": "قاموس هيكل تجزئة العمل يعطي الوصف التفصيلي لكل حزمة عمل في هيكل تجزئة العمل",
    "choices": [
      {
        "text": "خطة إدارة النطاق",
        "correct": false
      },
      {
        "text": "هيكل تجزئة العمل",
        "correct": false
      },
      {
        "text": "قاموس هيكل تجزئة العمل",
        "correct": true
      },
      {
        "text": "بيان نطاق المشروع",
        "correct": false
      }
    ]
  },
  {
    "id": 13,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "توني هو مدير مشروع برمجيات معقد. المشروع كبير جدًا وهام جدًا بالنسبة للعميل. تم الانتهاء من نظام البرمجيات، والحصول على قبول من العميل، ولكن بعد أيام قليلة تبين أن نظام البرمجيات يعطي نتائج غير متوقعة. العميل غاضب جدًا ويريد حل للمشكلة. أي من هذه العبارات تصف أفضل ما يجب أن يقوم به أولاً؟",
    "explanation": "مراجعة عملية فحص العميل للمنتج ليست من مسؤوليات مدير المشروع. الاعتذار للعميل قد يتم لاحقًا بعد معرفة السبب الأصلي للمشكلة. عدم فعل شيء مرفوض من منظور المسؤولية الاجتماعية والأخلاقية لمدير المشروع. الخيار الأفضل هو مراجعة عملية التحقق من النطاق فهي التي تتعلق بقبول العميل للمنتج",
    "choices": [
      {
        "text": "لا يجب أن يفعل شيئًا، فالعميل قد استلم المشروع.",
        "correct": false
      },
      {
        "text": "يجب أن يعتذر للعميل.",
        "correct": false
      },
      {
        "text": "يجب أن يراجع عملية التحقق من النطاق.",
        "correct": true
      },
      {
        "text": "يجب أن يراجع عملية فحص العميل للمنتج.",
        "correct": false
      }
    ]
  },
  {
    "id": 14,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أنت تقود فريقًا رشيقًا يعمل في مشروع برمجيات لتطوير تطبيق جوال. لقد أكملت أنت والفريق التكرار الأخير وستقومون بعرض إضافة المنتج المكتملة للمعنيين أثناء مراجعة الإطلاق. ما هي الملاحظات الأكثر قيمة في العرض التوضيحي للمنتج؟",
    "explanation": "تعني عبارة \"توجد جميع الميزات المطلوبة في الإضافة\" أنه تم استيفاء الأهداف وقبول إضافة المنتج",
    "choices": [
      {
        "text": "جميع الميزات المطلوبة موجودة في الإضافة.",
        "correct": true
      },
      {
        "text": "ممثل العميل يريد أن يشكر الفريق على جهودهم.",
        "correct": false
      },
      {
        "text": "قد يقوم العميل بإسناد مشاريع مستقبلية لفريقك.",
        "correct": false
      },
      {
        "text": "مدير التسويق أعجب بإضافة المنتج ويريد عرضها للعميل.",
        "correct": false
      }
    ]
  },
  {
    "id": 15,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "تم تكليف كريس بإدارة مشروع إنشاءات ضخم يضم عددًا كبيرًا من المعنيين. بدأ كريس مع فريق المشروع لجمع متطلبات المشروع من المعنيين. يبدو أن العديد من المعنيين لديهم متطلبات متناقضة وبعض المعنيين لديهم متطلبات غير واضحة. ماذا يجب أن يفعل كريس وفريقه في هذه الحالة؟",
    "explanation": "يجب جمع المتطلبات من جميع المعنيين بالمشروع. لن يؤدي ملء الاستبيان إلى الكشف عن جميع المتطلبات أو التضارب الواضح بين المتطلبات المتعارضة. الخيار الأفضل هو عقد اجتماعات وجهًا لوجه مع جميع المعنيين لفهم متطلباتهم وتوقعاتهم",
    "choices": [
      {
        "text": "لتجميع المتطلبات المطلوبة بدقة وبشكل فعال، يحتاج فريق المشروع إلى تجميع المتطلبات من المعنيين الرئيسيين فقط.",
        "correct": false
      },
      {
        "text": "لإزالة التعارض بين المتطلبات المتناقضة، يحتاج فريق المشروع إلى استخدام تقنية دلفي كشكل من أشكال استشارة الخبراء.",
        "correct": false
      },
      {
        "text": "لبناء توافق في الآراء بشأن متطلبات المشروع، يحتاج فريق المشروع إلى عقد اجتماعات وجهًا لوجه مع جميع المعنيين لفهم متطلباتهم وتوقعاتهم.",
        "correct": true
      },
      {
        "text": "لتجميع المتطلبات من عدد كبير من المعنيين، يحتاج فريق المشروع إلى إرسال استبيان ليتم ملؤه من قبل جميع المعنيين.",
        "correct": false
      }
    ]
  },
  {
    "id": 16,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "انضم بريان للتو إلى شركة إنشاءات كبيرة كمدير مشروع. وقد تم تعيينه لإدارة مشروعه الأول في الشركة. في منتصف المشروع، لاحظ أن العميل يحصل على طلبات تغيير متكررة يتم تنفيذها عن طريق الإقتراب غير الرسمي بين أعضاء الفريق. وقد أدى ذلك إلى تعطل العمل والإستياء بين أعضاء الفريق. ما الذي ينبغي أن يفعله أولاً لمعالجة هذا الوضع؟",
    "explanation": "يضمن ضبط نطاق المشروع معالجة كافة التغييرات المطلوبة والإجراءات التصحيحية أو الوقائية المقترحة من خلال عملية إجراء التحكم المتكامل في التغيير",
    "choices": [
      {
        "text": "البدء في إنشاء بيان مفصل لنطاق المشروع.",
        "correct": false
      },
      {
        "text": "دعوة لعقد اجتماع مع العميل وأعضاء الفريق لحل المشكلة.",
        "correct": false
      },
      {
        "text": "القيام بتعديل خطة إدارة المشروع بحيث أن تتم الموافقة على جميع طلبات التغيير عن طريقه.",
        "correct": false
      },
      {
        "text": "التأكد من أن ضبط النطاق يتم بشكل صحيح.",
        "correct": true
      }
    ]
  },
  {
    "id": 17,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "لأي من التالي يمكن استخدام هيكل تجزئة العمل؟",
    "explanation": "هيكل تجزئة العمل لا يظهر المدد، والعلاقات، وأسباب بدء المشروع ولكنه جزء من الخط المرجعي للنطاق الذي يستخدم كأساس للمقارنة بين الأداء الفعلي وما كان مخطط له",
    "choices": [
      {
        "text": "عرض العلاقات بين الأنشطة",
        "correct": false
      },
      {
        "text": "التواصل مع العميل",
        "correct": true
      },
      {
        "text": "عرض المدد الزمنية لكل حزمة عمل",
        "correct": false
      },
      {
        "text": "عرض الأسباب لبدء المشروع",
        "correct": false
      }
    ]
  },
  {
    "id": 18,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "سيرجيو هو الراعي لمشروع برمجيات كبير. ويشمل المشروع 1250 من المعنيين في ثلاثة بلدان مختلفة. عين مايكل كمدير لهذا المشروع. يتم تعيين ماريو، محلل أعمال ذو خبرة جيدة لهذا المشروع لإجراء تحليل الأعمال. من المسؤول عن ضمان أن تُراعى الأعمال المتعلقة بالمتطلبات في خطة إدارة المشروع وأن تُنفذ الأنشطة المتعلقة بالمتطلبات في الوقت المحدد وفي حدود الميزانية؟",
    "explanation": "مدير المشروع هو المسؤول عن ضمان أن تُراعى الأعمال المتعلقة بالمتطلبات في خطة إدارة المشروع وأن تُنفذ الأنشطة المتعلقة بالمتطلبات في الوقت المحدد وفي حدود الميزانية وأن تقدم قيمة",
    "choices": [
      {
        "text": "سيرجيو",
        "correct": false
      },
      {
        "text": "مايكل",
        "correct": true
      },
      {
        "text": "ماريو",
        "correct": false
      },
      {
        "text": "أعضاء فريق المشروع",
        "correct": false
      }
    ]
  },
  {
    "id": 19,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أنت مدير لمشروع إنشاءات مدته 7 أشهر. المشروع مهم جدًا للعميل ولمؤسستك. تقوم بعقد اجتماعًا أسبوعيًا مع العميل والمعنيين الرئيسيين بالمشروع. بعد 6 أشهر من العمل، المشروع يسير وفقًا للجداول الزمنية والميزانية، ولكن العميل غير راض عن تسليمات المشروع. هذا الموقف يمكنه تأخير اكتمال المشروع لشهرين. أي من التالي هي أهم عملية كان من الممكن أن تمنع مثل هذا الموقف؟",
    "explanation": "السؤال هنا يسأل عن العملية التي كان من الممكن أن تمنع هذا الموقف. إذا تم تحديد نطاق المشروع ونطاق المنتج ومخرجات المشروع بالتفصيل خلال عملية تحديد النطاق، فإنه سيمنع حدوث هذا الموقف",
    "choices": [
      {
        "text": "تحديد النطاق",
        "correct": true
      },
      {
        "text": "متابعة المخاطر",
        "correct": false
      },
      {
        "text": "متابعة الجدول الزمني",
        "correct": false
      },
      {
        "text": "ضبط النطاق",
        "correct": false
      }
    ]
  },
  {
    "id": 20,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "سيرجيو هو الراعي لمشروع برمجيات كبير. ويشمل المشروع 1250 من المعنيين في ثلاثة بلدان مختلفة. عين مايكل كمدير لهذا المشروع. يتم تعيين ماريو، محلل أعمال ذو خبرة جيدة لهذا المشروع لإجراء تحليل الأعمال. من المسؤول عن الأنشطة ذات الصلة بالمتطلبات في هذا المشروع؟",
    "explanation": "إذا كلف محلل الأعمال بمشروع، فإن الأنشطة ذات الصلة بالمتطلبات تكون مسؤولية هذا الدور",
    "choices": [
      {
        "text": "سيرجيو",
        "correct": false
      },
      {
        "text": "مايكل",
        "correct": false
      },
      {
        "text": "ماريو",
        "correct": true
      },
      {
        "text": "أعضاء فريق المشروع",
        "correct": false
      }
    ]
  },
  {
    "id": 21,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "لم يكمل فريق تطوير المشروع الرشيق أي ميزات جديدة خلال التكرار الأخير. سيقومون بإجراء عرض توضيحي للمنتج مع ممثل العملاء المعنيين. ماذا يجب أن يفعلوا؟",
    "explanation": "يمكن مناقشة الدروس المستفادة ولماذا لم يتم إكمال أي ميزات جديدة أثناء اجتماع التقييم بأثر رجعي. أثناء العرض التوضيحي للمنتج (مراجعة التكرار)، يقوم الفريق والمعنيين بمراجعة ما تم إنجازه في التكرار ويتعاونون بشأن ما يجب القيام به بعد ذلك. يمكن أيضًا تعديل سجل أعمال المنتج لتلبية الفرص الجديدة",
    "choices": [
      {
        "text": "يجب عليهم مناقشة قصص المستخدمين لإضافتها إلى التكرار التالي.",
        "correct": true
      },
      {
        "text": "يجب إلغاء العرض التوضيحي للمنتج.",
        "correct": false
      },
      {
        "text": "يجب عليهم مناقشة السبب الجذري لعدم وجود ميزات مكتملة جديدة أثناء هذا التكرار.",
        "correct": false
      },
      {
        "text": "يجب عليهم مناقشة الدروس المستفادة خلال التكرار الأخير.",
        "correct": false
      }
    ]
  },
  {
    "id": 22,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "قام فريق مشروع يتبع منهجية آچيل بإكمال 10 نقاط قصة في التكرار الحالي، على الرغم من التزام الفريق بإكمال 15 نقطة قصة لكل تكرار. ماذا يجب أن يفعل الفريق؟",
    "explanation": "يجب على فريق المشروع إكمال قصص المستخدمين العشر وإضافة قصص المستخدمين الخمسة المتبقية إلى سجل أعمال المنتج",
    "choices": [
      {
        "text": "اضافة المزيد من الموارد إلى التكرار الحالي.",
        "correct": false
      },
      {
        "text": "إعادة تقدير سرعة الفريق.",
        "correct": false
      },
      {
        "text": "إكمال 10 نقاط قصة وإضافة 5 نقاط قصة متبقية إلى سجل أعمال المنتج.",
        "correct": true
      },
      {
        "text": "تمديد التكرار الحالي.",
        "correct": false
      }
    ]
  },
  {
    "id": 23,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "جوزيف هو مدير لمشروع تصميم أجهزة. المشروع على وشك أن يكتمل عندما رفض العميل التوقيع على إحدى الفواتير الأخيرة قائلًا أنه يجب تسليم دليل المستخدم للأجهزة. جوزيف مذهول لأن دليل المستخدم لا ينبغي أن يكتمل من قبل شركته، وهذا حدث على الأرجح بسبب:",
    "explanation": "يجب أن ينص بيان نطاق المشروع بوضوح عن ما يتم وما لا يتم تضمينه في نطاق المشروع",
    "choices": [
      {
        "text": "لم يتم تحليل حزم الأعمال إلى أنشطة المشروع.",
        "correct": false
      },
      {
        "text": "لم تحدد استثناءات المشروع بشكل واضح في بيان نطاق المشروع.",
        "correct": true
      },
      {
        "text": "لم يرتبط هذا المطلب بتحقيق أي من أهداف المشروع، ولذلك تم حذفه من مصفوفة تتبع المتطلبات.",
        "correct": false
      },
      {
        "text": "لم يتم إدراج هذا المطلب في خطة إدارة المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "id": 24,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "مشروع في مراجعة التكرار الثالث، أثار أحد المعنيين تحفظات بشأن إضافة المنتج لهذا التكرار. أي مما يلي هو أفضل مسار للعمل؟",
    "explanation": "من الضروري معرفة تحفظات المعنيين بالمشروع بمزيد من التفاصيل، لذلك يجب ترتيب لقاء مع الشخص المعني بالمشروع ومالك المنتج لمعرفة مخاوفه بالتفصيل ومن ثم يمكن لمالك المنتج إضافة متطلبات الشخص المعني بالمشروع في سجل أعمال المنتج",
    "choices": [
      {
        "text": "إضافة مدخلًا في سجل الإشكالات وإعادة تقييم عملية تجميع المتطلبات.",
        "correct": false
      },
      {
        "text": "عقد اجتماع مع الفريق ومالك المنتج لمعالجة تحفظات المعنيين بالمشروع.",
        "correct": false
      },
      {
        "text": "الطلب من مالك المنتج إضافة تحفظات المعنيين بالمشروع إلى التكرار التالي.",
        "correct": false
      },
      {
        "text": "يجب على مدرب الفريق الرشيق تيسير اجتماع مع الشخص المعني بالمشروع ومالك المنتج لمناقشة تحفظاته.",
        "correct": true
      }
    ]
  },
  {
    "id": 25,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "هيكل تجزئة العمل هو وسيلة جيدة تساعدك على إدارة المشروع بشكل فعال. في هيكل تجزئة العمل يجب تحليل عملك إلى أجزاء أصغر وأكثر قابلية للإدارة. أي مما يلي لا يصف إلى أي مدى يتم تحليل العمل في المشروع؟",
    "explanation": "أخر مستوى من هيكل تجزئة العمل هو حزم العمل وهي ممكن أن تتم عن طريق أكثر من شخص وليس بشخص واحد. باقي الإختيارات هي من خصائص حزم العمل",
    "choices": [
      {
        "text": "حتى أنه لا يمكن تقسيمها منطقيًا لأكثر من ذلك.",
        "correct": false
      },
      {
        "text": "حتى يمكن تقديرها واقعيًا.",
        "correct": false
      },
      {
        "text": "حتى يمكن القيام بها من قبل شخص واحد.",
        "correct": true
      },
      {
        "text": "حتى يكون لديها نتيجة ذات معنى.",
        "correct": false
      }
    ]
  },
  {
    "id": 26,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "تم بدء مشروع جديد في منظمة ABC باستخدام نهج تكيفي. تم تحديد متطلبات المشروع الأولية في مراحل التخطيط الأولية وتحديد ترتيب أولوياتها من قبل العميل ومالك المنتج. ما الذي يجب عمله لهذه المتطلبات على مدار المشروع؟",
    "explanation": "يجب إعادة النظر في متطلبات المشاريع الرشيقة باستمرار، وإعادة ترتيب أولوياتها من قبل العميل ومالك المنتج على مدار المشروع.",
    "choices": [
      {
        "text": "يجب الحفاظ على المتطلبات ثابتة ما لم يتم تقديم طلب تغيير رسمي والموافقة عليه.",
        "correct": false
      },
      {
        "text": "يجب إعادة النظر في المتطلبات وإعادة ترتيب أولوياتها على مدار المشروع.",
        "correct": true
      },
      {
        "text": "يجب أن تبقى المتطلبات دون تغيير لتجنب تسيب النطاق.",
        "correct": false
      },
      {
        "text": "يجب أن يحدد فريق المشروع المتطلبات حسب الأولوية على مدار المشروع.",
        "correct": false
      }
    ]
  },
  {
    "id": 27,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "خلال اجتماع تخطيط التكرار، اختار فريق التطوير 50 نقطة قصة ليتم تنفيذها في التكرار التالي وفقًا لسرعة الفريق. طلب مالك المنتج منهم إضافة نقطتي قصة إضافيتين إلى التكرار التالي. ماذا يجب أن يفعل فريق التطوير؟",
    "explanation": "أثناء تخطيط التكرار، يكون لفريق التطوير القول الفصل في مقدار العمل الذي يمكن إنجازه في التكرار",
    "choices": [
      {
        "text": "رفض طلب مالك المنتج.",
        "correct": true
      },
      {
        "text": "إضافة نقطتي القصة إلى التكرار التالي.",
        "correct": false
      },
      {
        "text": "استبدالهم بنقطتين أخريين.",
        "correct": false
      },
      {
        "text": "زيادة سرعة الفريق إلى 52 نقطة قصة لكل تكرار.",
        "correct": false
      }
    ]
  },
  {
    "id": 28,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "وفقًا لهيكل تجزئة العمل (WBS)، المكون الذي يحمل المعرف (2) هو:",
    "explanation": "حساب المراقبة عبارة عن نقطة مراقبة إدارية يجري فيها التكامل بين النطاق والموازنة والجدول الزمني ومقارنتها مع القيمة المكتسبة بهدف قياس الأداء. ويضم حساب المراقبة اثنين أو أكثر من حزم العمل، رغم أن كل حزمة عمل ترتبط بحساب مراقبة واحد",
    "choices": [
      {
        "text": "حساب المراقبة",
        "correct": true
      },
      {
        "text": "حزمة عمل",
        "correct": false
      },
      {
        "text": "نشاط",
        "correct": false
      },
      {
        "text": "جزء مستبعد من المشروع",
        "correct": false
      }
    ]
  },
  {
    "id": 29,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "يناقش اثنان من أعضاء فريق المشروع حول الترتيب الصحيح لعمليات المتابعة والتحكم الخاصة بإدارة النطاق. أحدهم قال أن عملية التحقق من النطاق يجب أن تتم أولًا بينما قال الآخر أن عملية ضبط النطاق يجب أن تتم أولًا. أي من التالي هو الترتيب الصحيح لعمليات المتابعة والتحكم الخاصة بإدارة النطاق؟",
    "explanation": "تحدث عملية التحقق من النطاق مع كل تسليم أو مراجعة المرحلة وتكون عملية ضبط النطاق عملية مستمرة",
    "choices": [
      {
        "text": "أولًا التحقق من النطاق ثم ضبط النطاق",
        "correct": false
      },
      {
        "text": "أولًا ضبط النطاق ثم التحقق من النطاق",
        "correct": false
      },
      {
        "text": "الإثنان يحدثان معًا",
        "correct": false
      },
      {
        "text": "لا توجد معلومات كافية لإتخاذ قرار",
        "correct": true
      }
    ]
  },
  {
    "id": 30,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "يعمل فريق المشروع على مشروع برمجي في بيئة تكيفية. أكمل الفريق سمات التكرار الأول ويقوم الفريق بعرض المنتج الفعال. يرى مالك المنتج العرض التوضيحي ويرفض بعض القصص. أي مما يلي هو أفضل مسار للعمل؟",
    "explanation": "حينما ينتهي الفريق من المواصفات عادة في صورة قصص المستخدمين، فإن الفريق يعرض دوريًا المنتج الفعال، حيث يشاهد مالك المنتج العرض ويقبل أو يرفض القصص",
    "choices": [
      {
        "text": "يجب معالجة القصص المرفوضة من خلال تنقيح سجل الأعمال ويمكن دمجها في التكرار التالي.",
        "correct": true
      },
      {
        "text": "يجب على الفريق العمل على الفور على القصص المرفوضة وإجراء عرض آخر.",
        "correct": false
      },
      {
        "text": "يجب على مالك المنتج إتباع عملية التحكم في التغيير.",
        "correct": false
      },
      {
        "text": "يجب على الفريق توضيح تعريف المنجز لمالك المنتج.",
        "correct": false
      }
    ]
  },
  {
    "id": 31,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "تتضمن إدارة النطاق المنتجات والمتطلبات التي تتعلق بالمنتج من المشروع، في حين تشمل إدارة نطاق المشروع:",
    "explanation": "نطاق المشروع هو العمل الذي يُؤدى لتسليم منتج أو خدمة أو نتيجة تتوفر فيها السمات والوظائف المحددة. وأحيانًا يُنظر إلى مصطلح \"نطاق المشروع\" على أنه يشمل نطاق المنتج",
    "choices": [
      {
        "text": "العمل الذي سيقوم به مدير المشروع لإدارة المشروع.",
        "correct": false
      },
      {
        "text": "جهود إدارة المشاريع التي قام بها مدير المشروع.",
        "correct": false
      },
      {
        "text": "جميع الأعمال الموجودة في خطة إدارة النطاق.",
        "correct": false
      },
      {
        "text": "الأعمال التي ستقوم في المشروع لإنتاج نطاق المنتج.",
        "correct": true
      }
    ]
  },
  {
    "id": 32,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "يعمل كيفن في مشروع برمجيات كبير باستخدام نهج تكيفي، إنه يريد العثور على التغييرات في نطاق المشروع وتأثيرها على تقدم المشروع. أي من الأدوات التالية هو الأنسب للاستخدام؟",
    "explanation": "الميزة الكبرى لاستخدام مخطط المهام المنجزة هو أنه يمكن أن يظهر تغيرات في النطاق، مما يجعل تأثير تلك التغيرات مرئيًا",
    "choices": [
      {
        "text": "مخطط المهام غير المنجزة",
        "correct": false
      },
      {
        "text": "مخطط المهام المنجزة",
        "correct": true
      },
      {
        "text": "لوحة كانبان",
        "correct": false
      },
      {
        "text": "سجل أعمال المنتج",
        "correct": false
      }
    ]
  },
  {
    "id": 33,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "لوكاس هو ممارس للأسلوب الرشيق يقود مشروعًا رشيقًا. في منتصف المشروع، اكتشف هو والفريق أنهم التزموا بتقديم 50 نقطة قصة أثناء التكرار الحالي لكنهم في الواقع سيكونون قادرين على تقديم 40 نقطة قصة فقط. أي مما يلي هو أفضل مسار للعمل؟",
    "explanation": "تمديد التكرار ليس حلاً جيدًا، لأنه ينتهك مفهوم العمل الإضافي \"timebox\" الوقت المحدد وتعديل خطة التكرار ليس حلين استباقيين. أفضل إجابة هي إكمال 40 نقطة قصة وإضافة القصص غير المكتملة إلى سجل الأعمال.",
    "choices": [
      {
        "text": "قم بتمديد التكرار الحالي حتى يكمل الفريق نقاط القصة الملتزمة.",
        "correct": false
      },
      {
        "text": "اضبط خطة التكرار للحصول على 40 نقطة بدلاً من 50.",
        "correct": false
      },
      {
        "text": "أكمل 40 نقطة قصة وأضف 10 نقاط قصة إلى سجل أعمال المنتج.",
        "correct": true
      },
      {
        "text": "اعمل لوقت إضافي لإكمال نقاط القصة التي تم الالتزام بها أثناء التكرار الحالي.",
        "correct": false
      }
    ]
  },
  {
    "id": 34,
    "type": "multiple-choice",
    "categoryId": 1,
    "text": "أي مما يلي ليس مثالًا على تعريف \"المنجز\" في مشروع رشيق؟",
    "explanation": "يعد إنشاء تعريف مشترك لـ (المنجز) أمرًا بالغ الأهمية لإرضاء توقعات المعنيين لدينا، لذلك، من الضروري وجود تعريف مشترك للمنجز على كل مستوى من مستويات مشروع رشيق (قصة مستخدم - إصدار - منتج). يجب استخدام معايير موضوعية (كمية) لتعريف المنجز، ولا ينبغي استخدام المعايير الشخصية.",
    "choices": [
      {
        "text": "يعتبر المنتج (منجز) عند اكتمال أعمال التطوير، يتم توثيق الكود وتعديله.",
        "correct": true
      },
      {
        "text": "سيتم اعتبار الإصدار (منجز) عند قبول إصدار تطبيق الهاتف المحمول وعدم وجود عيوب في الأولوية 1 أو طلبات تغيير.",
        "correct": false
      },
      {
        "text": "يعتبر موقع الويب (منجز) عند اكتمال الميزات ذات الأولوية العالية وحصول الإصدار التجريبي على 80% على الأقل في استبيان رضا المستخدم.",
        "correct": false
      },
      {
        "text": "تعتبر قصة المستخدم (منجزة) عند اكتمال تطوير الكود وتوثيقه واختبار قبول المستخدم.",
        "correct": false
      }
    ]
  },
  {
    "id": 56,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "أعرب أحد المعنين الرئيسيين عن مخاوفه بشأن تقارير الحالة المرسلة من فريق المشروع. قال إنه يعاني من أجل الحصول على المعلومات اللازمة حول حالة المشروع حيث أن التقرير مليء بالمعلومات غير الضرورية. أي مما يلي هو افضل مسار عمل لمدير المشروع؟",
    "explanation": "تنتقل التقارير المعلومات ذات الصلة إلى المعنين (وعادة ما يتم ذلك بصورة ملخصة). غالباً ما يتم تسليم التقارير إلى المعنين المهتمين بوضع المشروع، مثل الرعاة أو .أصحاب الأعمال أو مكاتب إدارة المشاريع",
    "choices": [
      {
        "text": "أبلغ الشخص المعني بالمشروع أن تنسيق تقرير الحالة قد تم الاتفاق عليه في خطة إدارة التواصل. إذا اراد تغييره، يمكنه تقديم طلب التغيير.",
        "correct": false
      },
      {
        "text": "اسأل الشخص المعني بالمشروع عن احتياجاته من المعلومات وقم بتضمينها في تقرير الحالة.",
        "correct": true
      },
      {
        "text": "أبلغ الشخص المعني بالمشروع أن تقرير الحالة يلبي احتياجات مختلف المعنيين. لم يتم تصميمه وفقا لاحتياجات هذا الشخص فقط.",
        "correct": false
      },
      {
        "text": "أرسل تقريراً مفصلاً إلى هذا الشخص المعني بالمشروع مصمماً وفقا لاحتياجاته.",
        "correct": false
      }
    ]
  },
  {
    "id": 57,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "مارتن هو مدير المشروع في مشروع انشاءات كبير. فهو يجد صعوبات في الحفاظ على الجدول الزمني للمشروع على المسار الصحيح. وميزانية المشروع هي $3000000 و لديه 310 موارد بشرية. مدة المشروع هي ثلاثة اشهر. و به 380 نشاط. هناك 90 نشاط في المسار الحرج. ومؤشر أداء الجدول الزمني للمشروع هو 0.78 ومؤشر أداء التكلفة هو 1.09. في ظل هذه الظروف، ماذا ينبغي أن يتضمن تقرير الحالة الشهري؟",
    "explanation": "يحتوي تقرير الحالة على حالة المشروع وفقا .لخطة إدارة المشروع والخيارات الممكنة",
    "choices": [
      {
        "text": "أن المشروع سوف يحتاج إلى المزيد من الموارد.",
        "correct": false
      },
      {
        "text": "المشاكل و الخيارات.",
        "correct": true
      },
      {
        "text": "أن المشروع يسير بشكل جيد.",
        "correct": false
      },
      {
        "text": "أن المشروع سينتهي بعد تاريخ الإنتهاء المطلوب.",
        "correct": false
      }
    ]
  },
  {
    "id": 58,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "ناثالي تدير مشروع تطوير منتج. وخلال اجتماع حالة المشروع الاخير، عرضت مقاسات القيمة .المكتسبة لفريق المشروع وراعي المشروع SPI = 1.09 CPI = 0.79. ومن الواضح أن المشروع متجاوز. الميزانية و و راعي المشروع غاضب جداً وطلب منها أن ترسل له التكاليف التي تكبدها بشكل اسبوعي. ما هي العملية التي يجب أن تخضع لها لتقديم المعلومات المطلوبة إلى راعي المشروع؟",
    "explanation": "يمكن أن تتضمن منتجات التواصل بالمشروع التكلفة المتحملة وهي تتم اثناء عملية إدارة .التواصل",
    "choices": [
      {
        "text": "ضبط التكاليف",
        "correct": false
      },
      {
        "text": "تحديد الميزانية\nت. تقدير التكاليف",
        "correct": false
      },
      {
        "text": "تقدير التكاليف",
        "correct": false
      },
      {
        "text": "إدارة التواصل",
        "correct": true
      }
    ]
  },
  {
    "id": 59,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "بعد اجتماع حالة المشروع الأسبوعي مع أعضاء فريق المشروع، طلبت من أحد أعضاء فريق المشروع إرسال دقائق محضر الاجتماع لجميع الحضور. :تصنف محاضر الاجتماعات بأنها",
    "explanation": "التواصل الرسمي يشمل التقارير والاجتماعات الرسمية (المنتظمة والمتخصصة) وجداول أعمال ومحاضر الاجتماعات وتلخيصات المعنيين .والعروض التقديمية",
    "choices": [
      {
        "text": "تواصل رسمي",
        "correct": true
      },
      {
        "text": "تواصل غير رسمي",
        "correct": false
      },
      {
        "text": "تواصل خارجي",
        "correct": false
      },
      {
        "text": "تواصل شفهي",
        "correct": false
      }
    ]
  },
  {
    "id": 60,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "أي من المشاريع التالية تحتاج لنقل التفاصيل المتطورة والناشئة بصورة أكثر تكراراً وسرعة من أي مشاريع أخرى؟",
    "explanation": "نبيات المشروع الخاضعة لعناصر متنوعة من الغموض والتغير لديها حاجة متزايدة لنقل التفصيل المتطورة والناشئة بشكل متكرر أكثر .تكراراً وسرعة. في هذا السؤال مشروع تكنولوجيا المعلومات الذي له نطاق غير واضح حيث يتم تحديد نطاق مفصل والموافقة عليه قبل بدء كل تكرار يعتمد دورة حياة رشيقة أو .تكيفية. أما باقي المشاريع المذكورة فتتصف .بدورة حياة تنبؤية",
    "choices": [
      {
        "text": "مشروع تكنولوجيا المعلومات له نطاق غير واضح، حيث يتم تحديد نطاق مفصل والموافقة عليه قبل بدء كل تكرار.",
        "correct": true
      },
      {
        "text": "مشروع إنشاءات حيث يتم تحديد النطاق والوقت والتكلفة في المراحل المبكرة من دورة حياة المشروع.",
        "correct": false
      },
      {
        "text": "مشروع اتصالات عن بعد له دورة حياة تنبؤية وبه 550 من المعنيين بالمشروع.",
        "correct": false
      },
      {
        "text": "مشروع صناعي تم فيه إدارة التغييرات في النطاق بحرص.",
        "correct": false
      }
    ]
  },
  {
    "id": 61,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "كل ما يلي أمثلة على التواصل غير الشفهي باستثناء:",
    "explanation": "تشمل الأمثلة على التواصل غير الشفهي لغة الجسد الملائمة لنقل المعنى من خلال الإشارات وطبغة الصوت وتعبيرات الوجه. كما تعتبر .المحاكاة والتواصل بالعينين من الأساليب .الهامة",
    "choices": [
      {
        "text": "مدير المشروع يلوح بيده لعضو الفريق للترحيب به.",
        "correct": false
      },
      {
        "text": "ينظر المدرب إلى أعين المتدربين لمعرفة ما إذا كانوا يفهمون ما قاله أم لا.",
        "correct": false
      },
      {
        "text": "قائد فريق ينصح عضو الفريق حول كيفية استخدام التواصل غير الشفهي.",
        "correct": true
      },
      {
        "text": "قائد الفريق يستخدم نظرة غاضبة لعضو الفريق الذي .جاء للعمل في وقت متأخر",
        "correct": false
      }
    ]
  },
  {
    "id": 62,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "بسبب عوامل خارجية ، تم إنهاء المشروع في وقت مبكر. يرسل مدير المشروع تقرير المشروع النهائي إلى المعنيين بالمشروع عندما يطلب المدير الوظيفي نسخة من التقرير. ماذا يجب أن يفعل مدير المشروع في هذه الحالة؟",
    "explanation": "تحتوي خطة إدارة التواصل على المعلومات التي يجب إرسالها إلى أي من المعنيين.",
    "choices": [
      {
        "text": "يسأل المدير الوظيفي عن سبب حاجته للتقرير.",
        "correct": false
      },
      {
        "text": "لا يرسل التقرير ويقوم بإبلاغ مديره.",
        "correct": false
      },
      {
        "text": "إرسال التقرير.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة التواصل.",
        "correct": true
      }
    ]
  },
  {
    "id": 63,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "يتم تضمين جميع ما يلي في خطة إدارة التواصل للمشروع، باستثناء:",
    "explanation": "تفاصيل الإتصال لجميع المعنيين هي من ضمن محتويات سجل المعنيين",
    "choices": [
      {
        "text": "الإرشادات والقوالب الخاصة باجتماعات حالة المشروع",
        "correct": false
      },
      {
        "text": "استخدام الموقع الإلكتروني للمشروع وبرنامج إدارة المشروع",
        "correct": false
      },
      {
        "text": "تفاصيل الإتصال لجميع المعنيين",
        "correct": true
      },
      {
        "text": "الموارد المخصصة لأنشطة التواصل بما فيها الزمن والميزانية",
        "correct": false
      }
    ]
  },
  {
    "id": 64,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "ما هو الغرض من خطة إدارة التواصل؟",
    "explanation": "تعتبر خطة إدارة التواصل أحد مكونات خطة إدارة المشروع وتشرح كيفية تخطيط التواصل بالمشروع وتنظيمه وتنفيذه ومتابعته لضمان .فعاليته",
    "choices": [
      {
        "text": "خطة إدارة المشروع هي جزءية من الخطة الشاملة لإدارة التواصل.",
        "correct": false
      },
      {
        "text": "تصف خطة إدارة التواصل لماذا تحتاج إلى التواصل مع كل الأطراف المعنية.",
        "correct": false
      },
      {
        "text": "تصف خطة إدارة التواصل احتياجات توصيل المعلومات بما في ذلك شكل ومستوى التفاصيل.",
        "correct": true
      },
      {
        "text": "تركز خطة إدارة التواصل على استخدام تكنولوجيا الاتصالات من قبل فريق إدارة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "id": 65,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "طلب راعي المشروع من فريق المشروع زيادة معدل إرسال تقرير حالة المشروع بدلاً من إرسال تقرير حالة المشروع أسبوعياً ليكون يومياً. علماً على ذلك، فقد طلب أيضاً إرسال تقرير يومي عن التقدم المحرز في المهام المعلقة. يتعرض الفريق على طلب الراعي لأن إعداد هذا التقرير يستغرق وقتاً طويلاً. أي مما يلي هو أفضل مسار عمل لمدير المشروع؟",
    "explanation": "يجب على مدير المشروع مراجعة خطة إدارة التواصل التي تصف النوع والتكرار والشخص المسؤول عن إرسال كل تقرير. إذا كانت تحتاج إلى تغيير فمن يجب أن يتم ذلك من خلال طلب التغيير. لأنها جزء من خطة إدارة المشروع.",
    "choices": [
      {
        "text": "اطلب من الراعي توظيف موارد إضافية.",
        "correct": false
      },
      {
        "text": "حاول إقناع الطرفين بقبول إرسال التقرير مرتين في الأسبوع.",
        "correct": false
      },
      {
        "text": "قم بمراجعة خطة إدارة التواصل وارسال طلب التنبيه إذا لزم الأمر.",
        "correct": true
      },
      {
        "text": "اجتمع مع راعي المشروع وأقنعه بأن هذا العمل كثير للغاية على أعضاء الفريق القائم به.",
        "correct": false
      }
    ]
  },
  {
    "id": 66,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "أي مما يلي هو الغرض من اجتماعات حالة المشروع؟",
    "explanation": "اجتماعات حالة المشروع هي أفضل الطرق لمناقشة حالة المشروع وتبادل معلومات عن المشروع. باقي الاختيارات يمكن إجراؤها خارج اجتماع حالة المشروع.",
    "choices": [
      {
        "text": "تبادل المعلومات حول المشروع.",
        "correct": true
      },
      {
        "text": "موافقة طلبات التغيير.",
        "correct": false
      },
      {
        "text": "تقديم أعضاء الفريق تقريراً عما يقومون به.",
        "correct": false
      },
      {
        "text": "إصدار تقارير حالة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "id": 67,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "يقوم فرانك بإدارة مشروع إنشاءات بقيمة $30,000,000. المشروع SPI هو 1.01 و CPI هو 0.99. قام راعي المشروع بالاتصال به للتعبير عن قلقه إزاء المشروع، هو قلق لأن تاريخ انتهاء المشروع بعد أسبوعين. وقال إنه لا يعرف حالة المشروع، فأبلغه فرانك بأن فريقه يقوم بإرسال تقرير حالة أسبوعي عن طريق البريد الإلكتروني، فقال الراعي أنه لا يفضل البريد الإلكتروني لأنه يستقبل يومياً أكثر من 500 رسالة بريد إلكتروني ولا يقوم بفحص جميع رسائل البريد الإلكتروني وأنه يفضل التحديثات الشفهية. هذا الوضع يشير إلى وجود مشكلة في أي عملية من عمليات إدارة المشاريع؟",
    "explanation": "عملية وضع خطة إدارة التواصل تتضمن تحديد متطلبات التواصل للمعنيين بالمشروع ومنها تحديد وسيلة التواصل المفضلة لديهم، فعندما أبلغ راعي المشروع بأن فريقه يرسل تقرير حالة أسبوعي عن طريق البريد الالكتروني فإن ذلك يتم إرسال المعلومات وفقا لخطة إدارة التواصل. وبالتالي فإن خطة إدارة التواصل لا تعكس متطلبات المعنيين بالمشروع.",
    "choices": [
      {
        "text": "متابعة التواصل",
        "correct": false
      },
      {
        "text": "وضع خطة إدارة التواصل",
        "correct": true
      },
      {
        "text": "إدارة مشاركة المعنيين بالمشروع",
        "correct": false
      },
      {
        "text": "إدارة التواصل",
        "correct": false
      }
    ]
  },
  {
    "id": 68,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "أي من العبارات التالية صحيحة فيما يتعلق بالتواصل في المشاريع ذات دورة الحياة المتكيفة؟",
    "explanation": "بيئات المشروع الخاضعة لعناصر متنوعة من الغموض والتغير لديها حاجة جوهرية لنقل التفاصيل المتطورة والناشئة بصورة أكثر تكراراً وسرعة.",
    "choices": [
      {
        "text": "المشاريع ذات دورة الحياة التنبؤية لديها حاجة جوهرية لنقل التفاصيل المتطورة والناشئة بصورة أكثر تكراراً وسرعة من المشاريع ذات دورة الحياة التكرارية أو المتزايدة.",
        "correct": false
      },
      {
        "text": "المشاريع ذات دورة الحياة التنبؤية لديها حاجة جوهرية لنقل التفاصيل المتطورة والناشئة بصورة أكثر تكراراً وسرعة من المشاريع ذات دورة الحياة المتكيفة.",
        "correct": false
      },
      {
        "text": "لا يوجد فرق بين التواصل في المشاريع ذات دورة الحياة المتكيفة والتواصل في المشاريع ذات دورة الحياة التنبؤية.",
        "correct": false
      },
      {
        "text": "المشاريع ذات دورة الحياة المتكيفة لديها حاجة جوهرية لنقل التفاصيل المتطورة والناشئة بصورة أكثر تكراراً وسرعة من المشاريع ذات دورة الحياة التنبؤية.",
        "correct": true
      }
    ]
  },
  {
    "id": 69,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "أثناء إنشاء خطة إدارة التواصل للمشروع البرمجيات الخاص بك، يسأل أحد أعضاء الفريق ما إذا كان يمكن تضمين وسائل التواصل الاجتماعي كأداة تواصل لإستراتيجية التواصل للمشروع. ماذا ستكون إجابتك؟",
    "explanation": "تعمل استراتيجية التواصل المعيارية للتواصل مع المعنيين بالمشروع جميع التقنيات وتختار من بينها كما تحترم التفضيلات الثقافية والسياسية والشخصية للغة والوسائط والمحتوى والتسليم. وبناءً على ملاءمة، فإن وسائل التواصل الاجتماعي وغيره من تقنيات الحوسبة المتطورة قد تكون متضمنة.",
    "choices": [
      {
        "text": "نعم، يمكن تضمين وسائل التواصل الاجتماعي في استراتيجية التواصل لأن الجميع يستخدمون وسائل التواصل الإجتماعي في التواصل.",
        "correct": false
      },
      {
        "text": "نعم، يمكن تضمين وسائل التواصل الاجتماعي في استراتيجية التواصل فيما يتعلق بالتفضيلات الثقافية والسياسية والشخصية لغة والوسائط والمحتوى والتسليم.",
        "correct": true
      },
      {
        "text": "لا، لا يمكن تضمين وسائل التواصل الاجتماعي في استراتيجية التواصل لأنها أساليب تواصل غير رسمية. يجب عليك تحديد أداة تواصل رسمية.",
        "correct": false
      },
      {
        "text": "لا، لا يمكن تضمين وسائل التواصل الاجتماعي في استراتيجية التواصل لأنها غير متاحة في بعض الدول.",
        "correct": false
      }
    ]
  },
  {
    "id": 70,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "يتم تنفيذ مشروع كجزء من برنامج كبير. أثناء تنفيذ المشروع، يقوم مدير البرنامج بإبلاغ مدير المشروع أنه بسبب تغيير في المنظمة، سيتم إنهاء مشروعه. يريد مدير المشروع إبلاغ المعنيين بالمشروع وفريق المشروع بإغلاق المشروع. ما هي الوثيقة التي يجب الرجوع إليها؟",
    "explanation": "تشمل خطة إدارة التواصل الفعالة احتياجات المعلومات المتنوعة للمعنيين بالمشروع. وهي تشمل متطلبات التواصل مع المعنيين بالمشروع، والمعلومات التي سيتم توصيلها، بما في ذلك اللغة، والشكل، والمحتوى، ومستوى التفاصيل..إلخ",
    "choices": [
      {
        "text": "خطة إدارة التواصل",
        "correct": true
      },
      {
        "text": "خطة مشاركة المعنيين",
        "correct": false
      },
      {
        "text": "إرشادات إغلاق المشروع",
        "correct": false
      },
      {
        "text": "خطة إدارة التغيير",
        "correct": false
      }
    ]
  },
  {
    "id": 71,
    "type": "multiple-choice",
    "categoryId": 3,
    "text": "يمكن لعوائق التواصل أن تسبب خلل في التواصل، فإنه قد تؤثر على التواصل عند ارسال أو تلقي المعلومات. أي من التالي ليس عائقاً؟",
    "explanation": "ردود الفعل (الملاحظات) هي أداة لتحسين التواصل و ليست عائق.",
    "choices": [
      {
        "text": "التحيز والعداء",
        "correct": false
      },
      {
        "text": "المسافة",
        "correct": false
      },
      {
        "text": "الثقافة و اللغة",
        "correct": false
      },
      {
        "text": "ردود الفعل (الملاحظات)",
        "correct": true
      }
    ]
  }
]